{
  "backend/main.mo": "Actor entry point that imports and runs migration logic and mixes in blob storage functionality.",
  "backend/migration.mo": "Defines persistent data types for content and partners and provides a no-op migration from the old actor state to an empty new state.",
  "feature_evidence.json": "Empty feature evidence report with a features array placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend files, their roles, and functionality in the project.",
  "frontend/index.html": "HTML entry document that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component assembling all site sections within the I18nProvider.",
  "frontend/src/components/AboutSection.tsx": "Animated About section rendering logo, translated title, four paragraphs, and a banner image.",
  "frontend/src/components/ContentSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/ExportPackageGenerator.tsx": "Generates downloadable HTML, CSS, JS, and README export files with translated content.",
  "frontend/src/components/Footer.tsx": "Animated footer showing EU logo, disclaimer text, and copyright notice using translations.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation, smooth scrolling, and language switcher for desktop and mobile.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, Erasmus badge, project number, and tagline using translations.",
  "frontend/src/components/ObjectivesSection.tsx": "Animated objectives grid rendering six translated objective cards with icons.",
  "frontend/src/components/PartnersSection.tsx": "Renders a partners section showing partner data with localized descriptions, logos, and scroll animations.",
  "frontend/src/components/ResultsOutputsSection.tsx": "Displays three project outputs with icons, localized text, and scroll-triggered card animations.",
  "frontend/src/components/SocialMediaSection.tsx": "Shows a grid of social media links with icons, localized text, and animated interactive cards and buttons.",
  "frontend/src/components/TargetGroupsSection.tsx": "Renders three target group cards with images, localized titles and descriptions, and scroll animations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, initializing access control and refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Simple hook exposing the actor and fetch state from useActor for future backend query expansion.",
  "frontend/src/hooks/useScrollAnimation.ts": "IntersectionObserver-based hook that marks elements visible when scrolled into view, with optional reduced-motion handling.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides a React context for language selection, loading/storing the choice in localStorage and exposing a translation function.",
  "frontend/src/i18n/translations.ts": "Defines the translation types and English/Danish dictionary used by the i18n system.",
  "frontend/src/i18n/useI18n.ts": "Exports a simple hook that returns the i18n context.",
  "frontend/src/index.css": "Tailwind base styles and theme variables plus custom animations and scroll effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and theming, with plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, architectural notes, and known issues for the React/Tailwind + IC backend project."
}